const config = require('../config');
const { cmd, commands } = require('../command');
const os = require("os");
const { runtime } = require('../lib/functions');
const axios = require('axios');
const more = String.fromCharCode(8206);
const readMore = more.repeat(4001);
const fs = require('fs');
const path = require('path');

// Function to get Harare time
function getHarareTime() {
    return new Date().toLocaleString('en-US', {
        timeZone: 'Africa/Harare',
        hour12: true, // Use 12-hour format (optional)
        year: 'numeric',
        month: 'short',
        day: 'numeric',
        hour: 'numeric',
        minute: 'numeric',
        second: 'numeric'
    });
}

// Function to fetch version from package.json
async function fetchVersion() {
    try {
        const packageJsonUrl = 'https://raw.githubusercontent.com/tonicmeef/TONIC-MD/main/package.json';
        const response = await axios.get(packageJsonUrl);
        const packageJson = response.data;
        return packageJson.version || 'Unknown';
    } catch (error) {
        console.error("Error fetching version:", error);
        return 'Unknown';
    }
}

cmd({
    pattern: "menu",
    desc: "subzero menu",
    category: "menu",
    react: "✅",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        // Fetch version dynamically
        const version = await fetchVersion();

        let dec = `

       \`\`\`${config.BOT_NAME}\`\`\`
    
⟣──────────────────⟢
▧ *ᴄʀᴇᴀᴛᴏʀ* : *ᴛᴏɴɪᴄ ᴍᴜɴᴏᴅᴀᴡᴀғᴀ*
▧ *ᴍᴏᴅᴇ* : *${config.MODE}* 
▧ *ᴘʀᴇғɪx* : *${config.PREFIX}*
▧ *ʀᴀᴍ* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB 
▧ *ᴠᴇʀsɪᴏɴ* : *${version}* 
▧ *ᴜᴘᴛɪᴍᴇ* : ${runtime(process.uptime())} 
▧ *ᴛɪᴍᴇ* : ${getHarareTime()} 

⟣──────────────────⟢

> TONIC - ＭＤ- ＢＯＴ

⟣──────────────────⟢
${readMore}

*🏮 \`TONIC DOWNLOADER\` 🏮* 

╭─────────────···◈
*┋* *⬡ ғʙ*
*┋* *⬡ ɪɴꜱᴛᴀ*
*┋* *⬡ sᴘᴏᴛɪғʏ*
*┋* *⬡ ᴠɪᴅᴇᴏ*
*┋* *⬡ ɢᴅʀɪᴠᴇ*
*┋* *⬡ ᴛᴡɪᴛᴛᴇʀ*
*┋* *⬡ ᴛᴛ*
*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇ*
*┋* *⬡ ᴍᴇᴅɪᴀғɪʀᴇᴘʀᴏ*
*┋* *⬡ ꜱᴏɴɢ*
*┋* *⬡ ᴘʟᴀʏ*
*┋* *⬡ ᴘʟᴀʏ2*
*┋* *⬡ ᴘʟᴀʏ3*
*┋* *⬡ ᴠɪᴅᴇᴏ*
*┋* *⬡ ᴠɪᴅᴇᴏ2*
*┋* *⬡ ɢɪᴛᴄʟᴏɴᴇ*
*┋* *⬡ ɪᴍɢ*
*┋* *⬡ ᴀᴘᴋ*
*┋* *⬡ ʏᴛᴍᴘ3*
*┋* *⬡ ʏᴛᴍᴘ4*
*┋* *⬡ ᴘɪɴᴛᴇʀᴇsᴛ*
*┋* *⬡ ʙᴀɪsᴄᴏᴘᴇ*
*┋* *⬡ ɢɪɴɪsɪsɪʟᴀ*
*╰─────────────╶╶···◈*

*🔎 \`SEARCH-CMD\` 🔍* 

╭─────────────···◈
*┋* *⬡ ʏᴛꜱ*
*┋* *⬡ ʏᴛᴀ*
*┋* *⬡ ɢᴏᴏɢʟᴇ*
*┋* *⬡ ʟᴏʟɪ*
*┋* *⬡ ɢɪᴛsᴛᴀʟᴋ*
*┋* *⬡ ᴡɪᴋɪᴘᴇᴅɪᴀ*
*┋* *⬡ sʀᴇᴘᴏ*
*┋* *⬡ ᴍᴏᴠɪᴇɪɴғᴏ*
*┋* *⬡ ɢᴏᴏɢʟᴇ*
*┋* *⬡ ʙɪʙʟᴇ*
*┋* *⬡ ᴍᴏᴠɪᴇ*
*┋* *⬡ ᴡᴇᴀᴛʜᴇʀ*
*┋* *⬡ ssᴡᴇʙ*
*┋* *⬡ ɴᴘᴍ*
*╰─────────────╶╶···◈*

*🧠 \`AI-CMD\` 🧠* 

╭─────────────···◈
*┋* *⬡ ɢᴘᴛ*
*┋* *⬡ ᴀɪ*
*┋* *⬡ ʙᴏᴛ*
*┋* *⬡ ᴅᴀʀᴋɢᴘᴛ*
*┋* *⬡ ᴠɪsɪᴏɴ*
*┋* *⬡ sᴜʙᴢᴇʀᴏ*
*┋* *⬡ ɢᴇᴍɪɴɪ*
*┋* *⬡ ɢᴇᴍɪɴɪᴘʀᴏ*
*┋* *⬡ ʙɪɴɢ*
*┋* *⬡ ᴄᴏᴘɪʟᴏᴛ*
*┋* *⬡ ᴄʟᴀᴜᴅᴇᴀɪ*
*┋* *⬡ ᴀʀᴛ*
*┋* *⬡ ᴍɪsᴛʀᴀᴀɪ*
*┋* *⬡ ᴍᴇᴛᴀᴀɪ*
*┋* *⬡ ᴄʜᴀᴛɢᴘᴛ*
*┋* *⬡ ɢᴘᴛ3*
*┋* *⬡ ɢᴘᴛ4*
*┋* *⬡ ɢᴘᴛ4ᴏ*
*┋* *⬡ ʟʟᴀᴍᴀ2*
*┋* *⬡ ʟʟᴀᴍᴀ3*
*┋* *⬡ ғʟᴜx*
*┋* *⬡ ғʟᴜxᴘʀᴏ*
*┋* *⬡ ɪᴍᴀɢɪɴᴇ*
*┋* *⬡ ᴅᴀʟʟᴇ*
╰─────────────╶╶···◈

*👨‍💻 \`OWNER-CMD\` 👨‍💻* 

╭─────────────···◈
*┋* *⬡ ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*┋* *⬡ sᴇᴛᴛɪɴɢs*
*┋* *⬡ ᴏᴡɴᴇʀ*
*┋* *⬡ ʀᴇᴘᴏ*
*┋* *⬡ ʙᴏᴛsᴇᴛᴛɪɴɢs*
*┋* *⬡ ꜱʏꜱᴛᴇᴍ*
*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*
*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*
*┋* *⬡ ʙʟᴏᴄᴋ*
*┋* *⬡ ᴜɴʙʟᴏᴄᴋ*
*┋* *⬡ sʜᴜᴛᴅᴏᴡɴ*
*┋* *⬡ ᴄʟᴇᴀʀᴄʜᴀᴛs*
*┋* *⬡ sᴇᴛᴘᴘ*
*┋* *⬡ ғᴜʟʟᴘᴘ*
*┋* *⬡ ʙʀᴏᴀᴅᴄᴀsᴛ*
*┋* *⬡ ᴊɪᴅ*
*┋* *⬡ ɢᴊɪᴅ*
*┋* *⬡ ʀᴇꜱᴛᴀʀᴛ*
╰─────────────╶╶···◈

*👥 \`GROUP-CMD\` 👥* 

╭─────────────···◈
*┋* *⬡ ʀᴇᴍᴏᴠᴇ*
*┋* *⬡ ᴅᴇʟᴇᴛᴇ*
*┋* *⬡ ᴀᴅᴅ*
*┋* *⬡ ᴋɪᴄᴋ*
*┋* *⬡ ᴋɪᴄᴋᴀʟʟ*
*┋* *⬡ sᴇᴛɢᴏᴏᴅʙʏᴇ*
*┋* *⬡ sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
*┋* *⬡ ᴘʀᴏᴍᴏᴛᴇ*
*┋* *⬡ ᴅᴇᴍᴏᴛᴇ*
*┋* *⬡ ᴛᴀɢᴀʟʟ*
*┋* *⬡ ɢᴇᴛᴘɪᴄ*
*┋* *⬡ ɪɴᴠɪᴛᴇ*
*┋* *⬡ ʀᴇᴠᴏᴋᴇ*
*┋* *⬡ ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*┋* *⬡ ᴀʟʟʀᴇǫ*
*┋* *⬡ ᴍᴜᴛᴇ*
*┋* *⬡ ᴜɴᴍᴜᴛᴇ*
*┋* *⬡ ʟᴏᴄᴋɢᴄ*
*┋* *⬡ ᴜɴʟᴏᴄᴋɢᴄ*
*┋* *⬡ ʟᴇᴀᴠᴇ*
*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*
*┋* *⬡ ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*
*┋* *⬡ ᴊᴏɪɴ*
*┋* *⬡ ʜɪᴅᴇᴛᴀɢ*
*┋* *⬡ ɢɪɴғᴏ*
*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*
*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*
*┋* *⬡ ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*
*┋* *⬡ sᴇɴᴅᴅᴍ*
*┋* *⬡ ᴏᴘᴇɴᴛɪᴍᴇ*
*┋* *⬡ ᴄʟᴏsᴇᴛɪᴍᴇ*
╰─────────────╶╶···◈

*📃 \`INFO-CMD\` 📃* 

╭─────────────···◈
*┋* *⬡ ᴍᴇɴᴜ*
*┋* *⬡ ᴀʟʟᴍᴇɴᴜ*
*┋* *⬡ ʙᴇᴛᴀᴍᴇɴᴜ*
*┋* *⬡ ᴀʙᴏᴜᴛ*
*┋* *⬡ sᴄʀɪᴘᴛ*
*┋* *⬡ ʀᴇᴘᴏ*
*┋* *⬡ ᴍʀғʀᴀɴᴋ*
*┋* *⬡ ᴀʟɪᴠᴇ*
*┋* *⬡ ʙᴏᴛɪɴꜰᴏ*
*┋* *⬡ ꜱᴛᴀᴛᴜꜱ*
*┋* *⬡ ꜱᴜᴘᴘᴏʀᴛ*
*┋* *⬡ ᴘɪɴɢ*
*┋* *⬡ ᴘɪɴɢ2*
*┋* *⬡ sᴜʙᴢᴇʀᴏɪɴᴄ*
*┋* *⬡ ꜱʏꜱᴛᴇᴍ*
*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*
*┋* *⬡ ᴠᴇʀsɪᴏɴ*
*┋* *⬡ ᴘᴀɪʀ*
*┋* *⬡ ᴘᴀɪʀ2*
*┋* *⬡ ʀᴇᴘᴏʀᴛ*
╰─────────────╶╶···◈

*🍭 \`CONVERTER-CMD\` 🍭* 

╭─────────────···◈
*┋* *⬡ sᴛɪᴄᴋᴇʀ*
*┋* *⬡ ᴠsᴛɪᴄᴋᴇʀ*
*┋* *⬡ ᴛʀᴛ*
*┋* *⬡ ᴛᴛs*
*┋* *⬡ ʟᴏɢᴏᴘʀᴏ*
*┋* *⬡ ᴀᴛᴛᴘ*
*┋* *⬡ ʟᴏɢᴏ*
*┋* *⬡ ʟᴏɢᴏ1*
*┋* *⬡ ʟᴏɢᴏ2*
*┋* *⬡ ғᴀɴᴄʏ*
*┋* *⬡ ᴠᴠ*
*┋* *⬡ ϙʀ*
*┋* *⬡ ᴛɪɴʏ*
*┋* *⬡ sʜᴏʀᴛ*
*┋* *⬡ ᴠᴇʀsɪᴏɴ*
*┋* *⬡ ᴛᴇᴍᴘᴍᴀɪʟ*
*┋* *⬡ ᴇɴᴄᴏᴅᴇ*
*┋* *⬡ ᴅᴇᴄᴏᴅᴇ*
*┋* *⬡ ʀɪɴɢᴛᴏɴᴇs*
*┋* *⬡ ᴜʀʟ*
*┋* *⬡ ᴜᴘʟᴏᴀᴅ*
╰─────────────╶╶···◈

*⚙️ \`SUBZERO-SETTINGS\` ⚙️* 

╭─────────────···◈
*┋* *⬡ sᴜʙᴢᴇʀᴏᴇɴᴠ*
*┋* *⬡ ᴜᴘᴅᴀᴛᴇ*
*┋* *⬡ ᴘɪɴɢ*
*┋* *⬡ ᴍʀғʀᴀɴᴋ*
*┋* *⬡ ᴏᴡɴᴇʀ*
*┋* *⬡ sᴜʙᴢᴇʀᴏɪɴᴄ*
*┋* *⬡ ᴀʙᴏᴜᴛ*
*┋* *⬡ sᴇᴛᴛɪɴɢs*
*┋* *⬡ ᴠᴇʀsɪᴏɴ*
*┋* *⬡ sᴜᴘᴘᴏʀᴛ*
*┋* *⬡ ᴀʟɪᴠᴇ*
*┋* *⬡ sᴇssɪᴏɴs*
*┋* *⬡ ʀᴇᴘᴏᴛʀᴇᴇ*
*┋* *⬡ ʟɪsᴛᴘʟᴜɢɪɴs*
*┋* *⬡ ᴘʟᴜɢɪɴᴅʟ*
╰─────────────╶╶···◈

*♻️ \`RANDOM-CMD\` ♻️* 

╭─────────────···◈
*┋* *⬡ ᴄᴘᴘ*
*┋* *⬡ ᴅᴏɢ*
*┋* *⬡ ʀᴀɴᴅᴏᴍᴡᴀʟʟᴘᴇʀ*
*┋* *⬡ ʟᴏʟɪ*
*┋* *⬡ ᴀᴡᴏᴏ*
*┋* *⬡ ᴡᴀɪғᴜ*
*┋* *⬡ ɢᴀʀʟ*
*┋* *⬡ ᴍᴀɪᴅ*
*┋* *⬡ ɴᴇᴋᴏ*
*┋* *⬡ ᴀɴɪᴍᴇ*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ1*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ2*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ3*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ4*
*┋* *⬡ ᴀɴɪᴍᴇɢɪʀʟ5*
╰─────────────╶╶···◈

*🎀 \`WALLPAPERS-CMD\` 🎀* 

╭─────────────···◈
*┋* *⬡ ɪᴍɢ*
*┋* *⬡ ᴡᴀʟʟᴘᴀᴘᴇʀ*
*┋* *⬡ ᴅᴏɢ*
╰─────────────╶╶···◈

*😆 \`FUN-CMD\` 😆* 

╭─────────────···◈
*┋* *⬡ sʜʏ*
*┋* *⬡ sʜʏʏ*
*┋* *⬡ ʜᴀᴘᴘʏ*
*┋* *⬡ sᴀᴅ*
*┋* *⬡ ᴀɴɢʀʏ*
*┋* *⬡ ʜᴀɴᴅ*
*┋* *⬡ ɴɪᴋᴀʟ*
*┋* *⬡ ʜᴜɢ*
*┋* *⬡ ᴍᴏᴏɴ*
*┋* *⬡ ᴋɪss*
*┋* *⬡ ᴄᴏɴғᴜsᴇᴅ*
*┋* *⬡ ʜᴇᴀʀᴛ*
*┋* *⬡ ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
*┋* *⬡ ғᴀᴄᴛ*
*┋* *⬡ ᴛʀᴜᴛʜ*
*┋* *⬡ ᴅᴀʀᴇ*
*┋* *⬡ ᴄʜᴀʀᴀᴄᴛᴇʀ*
*┋* *⬡ ᴅɪᴀʀʏ*
*┋* *⬡ sᴇᴛᴅɪᴀʀʏᴘᴀssᴡᴏʀᴅ*
*┋* *⬡ ʟᴏɢɪɴ*
*┋* *⬡ ɢᴇᴛɪᴅ*
*┋* *⬡ ʀᴇsᴇᴛᴅɪᴀʀʏᴘᴀssᴡᴏʀᴅ*
╰─────────────╶╶···◈


*❄️ \`TOOLS-CMD\` ❄️* 

╭─────────────···◈
*┋* *⬡ ᴛʀᴛ*
*┋* *⬡ ᴊᴏᴋᴇ*
*┋* *⬡ ᴛᴛs*
*┋* *⬡ ꜰᴀᴄᴛ*
*┋* *⬡ ɢɪᴛʜᴜʙ*
*┋* *⬡ ɢᴘᴀꜱꜱ*
*┋* *⬡ ssᴡᴇʙ*
*┋* *⬡ sʜᴏʀᴛᴇɴ*
*┋* *⬡ ᴛɪɴʏᴜʀʟ*
*┋* *⬡ ʜᴀᴄᴋ*
*┋* *⬡ ǫᴜᴏᴛᴇ*
*┋* *⬡ ʀᴇᴘᴏ*
*┋* *⬡ ᴛɢsᴛɪᴄᴋᴇʀ*
*┋* *⬡ sʀᴇᴘᴏ*
*┋* *⬡ ᴅᴇꜰɪɴᴇ*
*┋* *⬡ ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ*
*┋* *⬡ ᴀɴᴛɪᴅᴇʟᴇᴛᴇ ᴀʟʟ*
*┋* *⬡ ᴀɴᴛɪᴅᴇʟᴇᴛᴇ*
*┋* *⬡ ᴀɴᴛɪᴄᴀʟʟ*
*┋* *⬡ ᴀᴜᴛᴏʙɪᴏ*
*┋* *⬡ ϙʀ*
*┋* *⬡ ʀᴇᴀᴅϙʀ*
*┋* *⬡ ᴇɴᴄᴏᴅᴇ*
*┋* *⬡ ᴅᴇᴄᴏᴅᴇ*
╰─────────────╶╶···◈

*🔞 \`NSFW-CMD\` 🔞* 

╭─────────────···◈
*┋* *⬡ ᴇᴊᴀᴄᴜʟᴀᴛɪᴏɴ*
*┋* *⬡ ᴘᴇɴɪs*
*┋* *⬡ ᴇʀᴇᴄ*
*┋* *⬡ ɴᴜᴅᴇ*
*┋* *⬡ sᴇx*
*┋* *⬡ ᴄᴜᴛᴇ*
*┋* *⬡ ᴏʀɢᴀsᴍ*
*┋* *⬡ ᴀɴᴀʟ*
*┋* *⬡ sᴜsᴘᴇɴsɪᴏɴ*
*┋* *⬡ ᴋɪss*
╰─────────────╶╶···◈

*🐛 \`BUG MENU\` ⚙* 

╭─────────────···◈
*┋* *⬡ ʙᴜɢs ᴄᴏᴍɪɴɢ sᴏᴏɴ ⚠️*
*┋* *⬡ ᴢᴇʀᴏᴄʀᴀsʜ*
*┋* *⬡ ᴢᴇʀᴏғʀᴇᴇᴢᴇ*
*┋* *⬡ ᴢᴇʀᴏʟᴀɢ*
*┋* *⬡ ᴢɪᴏs*
*┋* *⬡ ᴢᴀɴᴅʀᴏɪᴅ*
*┋* *⬡ ᴢᴋɪʟʟ*
*┋* *⬡ ᴢsᴘᴀᴍ*
*┋* *⬡ ᴢғʟᴏᴏᴅ*
*┋* *⬡ ᴢᴇʀᴏᴇxᴇᴄᴜᴛɪᴏɴ*
*┋* *⬡ ᴢʜᴇᴀᴅsʜᴏʀᴛ*
*┋* *⬡ ᴢᴜɪ*
╰─────────────╶╶···◈




*━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠
> ＭＡＤＥ ＢＹ ＭＲ ＦＲＡＮＫ
*━━━━━━━━━━━━━━━━━━━━━*
`;

await conn.sendMessage(
            from,
            {
                image: { url: `https://i.postimg.cc/WpQLCg85/White-and-Green-Simple-Professional-Business-Project-Presentation.jpg` },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363374632065395@newsletter',
                        newsletterName: 'Tᴏɴɪᴄ Tᴇᴄʜ Iɴᴄ. ',
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, { //https://github.com/
            audio: { url: null },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`${e}`);
    }
});



